package edu.training.jc.homework;

// Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
public class Branching02 {

	public static void main(String[] args) {
		byte a = 1, b = 2;

		if (a < b) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}

	}

}
